app/views/lists/index.html.erb

SELECT `list_items`.* FROM `list_items` WHERE `list_items`.`list_id` = 1
SELECT `lists`.* FROM `lists`
---
      <%= link_to "Add New List Item", new_list_item_path(:user_id => list.id), :class => "sub--item-button" %>
      <% if list.list_items.present? %>