app/controllers/lists_controller.rb

SELECT `lists`.* FROM `lists` WHERE `lists`.`archive` = 1
---
	def index
		@lists = List.all.un_archive

INSERT INTO `lists` (`name`, `created_at`, `updated_at`) VALUES ('My First New Post', '2019-03-17 11:55:11', '2019-03-17 11:55:11')
---
	def create
		@list = List.new(list_fetched_params)

		respond_to do |format|
		  if @list.save

UPDATE `lists` SET `name` = 'jahan zaeem Khan', `updated_at` = '2019-03-17 15:57:17' WHERE `lists`.`id` = 9
---
	def update
		respond_to do |format|
		  if @list.update(list_fetched_params)

DELETE FROM `lists` WHERE `lists`.`id` = 1
---
	def destroy
		@list.destroy

SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 9 LIMIT 1
---
	  def set_item
	    @list = List.find(params[:id])