app/controllers/list_items_controller.rb

	def new
		@list = List.find_by_id params[:user_id]
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`id` = 2 LIMIT 1

	def create
		@list_item = ListItem.new(list_item_fetched_params)

		respond_to do |format|
		  if @list_item.save
---
INSERT INTO `list_items` (`name`, `list_id`, `created_at`, `updated_at`) VALUES ('ha jeee', 5, '2019-03-17 19:54:49', '2019-03-17 19:54:49')

	def update
		respond_to do |format|
		  if @list_item.update(list_item_fetched_params)
---
UPDATE `list_items` SET `name` = 'ha jeee bhai', `updated_at` = '2019-03-17 19:55:57' WHERE `list_items`.`id` = 8

	def destroy
		@list_item.destroy
---
DELETE FROM `list_items` WHERE `list_items`.`id` = 3

	  def set_list_item
	    @list_item = ListItem.find(params[:id])
---
SELECT  `list_items`.* FROM `list_items` WHERE `list_items`.`id` = 8 LIMIT 1